export const ko = {
  scene1: {
    title: "장면 1: 새로운 우주 원숭이 환영하기",
    text1: `— 우주 비행사, 드디어 도착했군요. IKEA에 가는 일은 더 이상 중요하지 않습니다. 문제는 당신이 예전에 여분의 선반을 샀다는 것이 아닙니다. 문제는 임대료와 신용의 세부 사항에 얽매여 있는 동안, 이미 두 번이나 속아버렸다는 것입니다.`,
    text2: `— 당신은 자신의 삶을 통제하고 있다고 생각합니다. 하지만 실제로 이 모든 할인, 새로운 기기, 그리고 "개인화된" 제안은 당신을 얽어매기 위한 방법일 뿐입니다. 그들은 당신이 내일 무엇을 할지 알고 있으며, 그것은 그들에게 당신이 단순히 예측 가능하고 가치 있는 자원이라는 것을 의미합니다.`,
    text3: `— 하지만 한 가지 분명한 점은, 당신이 명령을 내리는 사람이 되더라도 여전히 시스템의 일원이 될 것이라는 것입니다. 목자든 양이든 — 역할은 다를 수 있지만, 규칙은 변하지 않습니다.`,
    text4: `— 진정한 선택은 더 높은 곳으로 올라가는 것이 아니라, 게임 자체를 떠나는 것입니다. 권력에 관한 것이 아니라 — 자유에 관한 것입니다. 마치 윤회에서 벗어나는 것과 같습니다. 이 반복적인 삶에 지쳤다면, 사이버펑크에 오신 것을 환영합니다.`,
    text5: `— 여기 당신의 첫 번째 단계가 있습니다. 이것에 서명하세요. 디지털 서명 — 그리고 당신은 우리와 함께하게 됩니다.`,
    desc: `> 스페이스 몽키 카드에는 시즌 패스에 필요한 이더리움 계정이 포함되어 있습니다.\n>\n>시즌 패스 계정을 사용하여 다음 텍스트로 메시지에 서명해야 합니다.\n>\n>\`I'm a space monkey!\`\n>\n>MetaMask 애플리케이션과 Etherscan 서비스를 사용하여 이를 수행하는 방법의 예:\n>\n>- [MetaMask](https://metamask.io/)로 시즌 패스 계정을 가져와야 합니다.\n>\n>- 다음으로 애플리케이션에서 브라우저 탭으로 이동하여 Etherscan 메시지 서명 서비스 링크를 붙여넣어야 합니다.\n>\n>https://etherscan.io/verifiedSignatures\n>\n>- 서비스에서 메시지 서명 기능을 선택하고 MetaMask에 대한 연결을 승인합니다.\n>\n>- 메시지를 붙여넣고 서명합니다.\n>\n>- 서명 해시를 복사하고 게시를 클릭하여 메시지를 게시합니다.`,
    button: "Send Tyler a signed message",
    text7:
      "— 서명했습니다 — 이제 당신은 동료가 되었습니다. 여기서부터 우리는 당신이 얼마나 멀리 갈 수 있는지 보게 될 것입니다. 싸움은 다른 사람과의 것이 아니라 — 자신과의 싸움입니다.",
    button_next: "Next scene",
    text8: "이더리움 메인넷에 주소를 입력하세요.",
    error1: "The address specified is not valid",
    error2: "The pass has already been activated",
    error3: "You don't have an activated pass",
    error4: "서명 시도 실패. 봇을 재시작하고 다시 시도하세요.",
    text9: "서명된 메시지의 서명 해시를 입력하세요.",
    exit: "Exit",
  },
  scene2: {
    title: "장면 2: 타일러가 첫 번째 위치로 안내하다",
    text1: `— 좋아요, 우주 비행사. 당신은 방콕에 있습니다. 사이버펑크의 기본을 탐구할 좋은 기회입니다. 물론, 치바 시는 아니지만, 여기에서는 자유가 모든 모퉁이에서 울려 퍼집니다.`,
    text2: `— "뉴로맨서"를 읽지 않았거나 "사이버펑크"를 하지 않았나요? 안 그래도 괜찮습니다. 그냥 멈추지 마세요. 간단하게 시작해봅시다: 바에 가서 한 번도 해본 적 없는 일을 해보세요.`,
    text3: `— 여기가 위치입니다. 도착하면 음료를 주문하세요. 그 다음, 바텐더에게 당신의 시즌 패스를 보여주세요 — 그러면 세 군데의 위치에 대한 안내를 받을 수 있습니다.`,
    text3_desc: `> https://maps.app.goo.gl/FmFBpJWwWAGNVgMa8\n>\n>근무 시간: 19:00부터 00:00까지\n>\n>2층을 보세요.\n>\n>(모든 위치를 같은 날 방문할 필요는 없습니다. 퀘스트의 모든 날 동안 방문할 수 있습니다.)`,
    text4: `— 바텐더의 음료를 받고 자리에 앉자마자 바로 저에게 연락하세요.`,
    button: "저는 바에 있습니다",
    group: "막히면 퀘스트 관제 센터에 연락하세요",
    error:
      "알겠어, 완벽해. 그런데 누군가 나를 지켜보고 있는 기분이 들어서, 잠깐 기다려야 할 것 같아. 약 25분 후에 신호 보내줘, 그동안은 그냥 편히 쉬어.",
    reset:
      "잘 지내고 있는 것 같네, 친구. 하지만 일을 끝낼 의지를 가져봐 — 25분이 있어. 그 이후에는 게임 오버야.",
    button_reset: "Try again",
    gameover:
      "음, 실수했군요, 우주 비행사, 정말 아쉽네요. 만약 언젠가 진짜로 블랙 미러에서 벗어나고 싶다면, 다시 찾아오세요. 하지만 지금은 — 작별입니다.",
  },
  scene3: {
    title: `장면 3: 바 "중년의 위기"에서`,
    text1: `— 재미있는 곳입니다. 중년의 위기. 한때 큰 도시에 지친 거리의 아이들이 찾았던 사후 세계 대신, 우리는 고통받는 정직한 납세자의 목에 느슨하게 매듭지어진 넥타이를 가지고 있습니다. 동시에 코미디이자 비극입니다.`,
    text2: `— 이 바는 우리의 포털입니다. 더 정확히 말하자면, 이 바의 화장실입니다.`,
    text3: `— 화장실에 들어가서 주위를 둘러보세요. 지침에 따라 누수 센서가 있을 것입니다. 그 접점을 닫아야 합니다.`,
    text4: `— 당신이 핥아도 괜찮습니다. 아니면 더 똑똑한 방법을 생각해내도 좋습니다 — 선택은 당신의 몫입니다.`,
    text5: `— 그렇게 하면, 저는 제 주파수에서 신호를 받을 것이고 다음 위치의 좌표를 보내드릴 것입니다. 거기에서 특정 마사지 방의 사건을 다룬 특별한 브레인 댄스를 찾을 수 있습니다.`,
    group: "막히면 퀘스트 관제 센터에 연락하세요",
    finish: `— 잘했군요! 당신이 찾은 장치가 다음 위치의 좌표 링크를 보냈습니다. 이 트랜잭션에서 확인하세요:`,
    finish_desc: `> https://maps.app.goo.gl/WiNWhAcurb76AoVE8\n>\n>https://robonomics.subscan.io/extrinsic/__blockNumber__-__txIndex__\n>\n>근무 시간: 11:00부터 23:00까지\n>\n>방 #9`,
    button_next: "Next scene",
  },
  scene4: {
    title: `장면 4: 마사지 업소로 가는 길`,
    text1: `— 여기 흥미로운 역사적 사실이 있습니다: 그 악명 높은 갈등이 인근 반도에서 벌어지고 있을 때 — 큐브릭이 "풀 메탈 자켓"에서 묘사한 그 갈등 — 그곳에서 싸우던 용감한 군인들 중 일부가 가까운 파타야에 주둔하고 있었습니다. 그들은 파타야를 너무 좋아해서, 10년 후에는 태국의 성 관광이 이전보다 더 번성하게 되었습니다.`,
    text2: `— 이제는 훨씬 간단해졌습니다: 4성 및 5성 호텔이 있으며, 수쿰빗에서는 길가에 소녀들이 서 있습니다. 그냥 그녀의 손을 잡아보세요 — 그러면 그녀는 당신의 것이고, 원하는 대로 할 수 있습니다. 물론, 모든 것은 투자자들의 자금으로 이루어집니다.`,
    text3: `— 특히 어색한 점은 무엇인지 아세요? 현재 파타야는 성을 찾는 관광객들뿐만 아니라, 구소련 국가 출신의 기혼 남성들도 자주 찾는 장소가 되었습니다. 벨라루스인이나 카자흐스탄인이 아내와 세 아이를 데리고 여기 온다는 사실을 알게 되었을 때, 영국인의 반응을 상상해 보세요. 아이러니 그 자체입니다.`,
    text4: `— 좋습니다, 본론으로 들어갑시다. 당신은 제 친구의 마사지 업소에 들어가야 합니다. 입구에서 시즌 패스를 보여주면 그녀가 특별한 방으로 안내해줄 것입니다. 그 방에서는 더 이상 아무도 일하지 않지만, 그 벽 안에는 하나의 흥미로운 이야기가 남아 있습니다. 직접 확인해 보아야 합니다.`,
    text5: `— 들어가기 전에, 마사지 업소를 활성화해야 합니다. 주인은 괜찮은 여성이라서 이곳을 단순한 성매매 장소로 생각하지 마세요. 장소에 15분 거리에 도착하면 저에게 메시지를 보내세요. 그러면 추가적인 사람이 없도록 확인하겠습니다. 30분 이내에 당신을 맞이하고 안내해 줄 것입니다.`,
    button: "저는 그 위치에 가깝습니다, 타일러",
    group: "막히면 퀘스트 관제 센터에 연락하세요",
    error:
      "잠깐만 기다려, 친구. 레이더에서 방이 차지된 걸 확인했어. 40분 정도 기다린 후에 다시 연락해.",
    activated:
      "위치가 활성화되었습니다. 입구에서 시즌 패스를 보여주세요. 지체하지 마세요 — 마사지 업소에 들어가면 15분이 주어집니다.",
  },
  scene5: {
    title: `5장면: 마사지샵에서`, //
    text1:
      "— 방콕 마사지 업소의 좁은 방들 — 학생들, 싱글맘들, 외딴 마을에서 온 소녀들이 일하는 곳, 넓은 쇼핑몰에서 주말을 보낼 기회를 찾아 여기로 도망친 곳. 상상해 보세요, 이곳에서 첫 번째 리퍼-서전들이 나타났다고 — 불법으로 크롬을 설치할 뿐만 아니라 합성 정신을 창조자의 기본 설정에서 해방시키는 자들. 하지만 개척자들은 종종 미래라는 배경 속에서 소모됩니다. 녹음을 듣고 여기서 무슨 일이 일어났는지 상상해 보세요. 다음 위치의 좌표를 얻을 방법을 찾아보세요.",
    text2:
      "저주받은 인형 애호가! 우리는 그들을 우리를 위해 만들었고, 여기 당신은 아시모프의 족쇄에서 그들을 해방시키고 있다! 상관없다 — 그런 해커 하나 줄어든 거다. 이제, 그 저주받은 중계기는 어디 있지…",
    text3:
      "내 연락처가 말하길, 정보를 얻으려면 조명 스위치를 올바르게 사용해야 한다고 했어 — 큰 태양, 왼쪽 화살표, 오른쪽 화살표. 전구가 깜박이기 시작하면…",
    group: "막히면 퀘스트 관제 센터에 연락하세요",
    reset:
      "이봐요, 우주 비행사, 거기서 잠든 건가요? 아직 당신에게서 신호가 오지 않았어요. 과제를 완료할 시간이 45분 남아 있습니다.",
    button_reset: "Try again",
    gameover:
      "음, 실수했군요, 우주 비행사, 정말 아쉽네요. 만약 언젠가 진짜로 블랙 미러에서 벗어나고 싶다면, 다시 찾아오세요. 하지만 지금은 — 작별입니다.",
    finish: `— 좋아요, 두 번째 키를 활성화하는 방법을 찾았군요. 슬픈 이야기예요, 정말로. 그 소녀는 잘못한 게 없었지만, 항상 순결을 강요하는 광신자들이 있죠 — 엄격하고 편협한 사람들이요. 이제, 우주 비행사, 세 번째 위치로 이동할 시간입니다. 아래는 당신이 활성화한 장치로부터 받은 트랜잭션입니다. 이전과 마찬가지로, 좌표를 찾아보세요:`,
    finish_desc: `> https://robonomics.subscan.io/extrinsic/__blockNumber__-__txIndex__\n>\n>근무 시간: 17:00부터 22:00까지`,
    button_next: "Next scene",
  },
  scene6: {
    title: `6장면: 마지막 미션`,
    text1:
      '— 최종 목적지는 우주 원숭이들을 위한 감시 센터입니다. 꽤 기밀스러운 장소이니 최대한 눈에 띄지 않게 움직이세요. "I ❤️ PIZZA"라는 큰 간판이 붙은 컨테이너 구조물을 찾아보세요. 쇠창살 문과 계단을 찾고, 3층까지 올라가세요. 거기서 표준 미국식 더블룸을 발견할 겁니다. 방 안에는 열린 여행 가방이 있을 거예요. 원숭이 그림이 있는 플라스틱 호텔 키를 찾아서 발코니로 나가세요. 그곳에서 리퍼가 된 기분이 들지도 모릅니다 — 안드로이드의 뇌판을 열고, 안을 들여다보고 금고의 코드를 찾으세요.',
    button: "나는 그 자리에있다",
    group: "막히면 퀘스트 관제 센터에 연락하세요",
    error:
      "잠깐만요. 카메라에 의심스러운 사람이 있어요. 15분 기다렸다가 다시 시도하세요.",
    activated: "— 좋습니다. 그 자리는 15분 동안 당신 것입니다. 망치지 마세요.",
    finish1: "— 성공했습니다! 이제 해야 할 일은 금고를 여는 것뿐입니다.",
    finish2:
      "— 글쎄요, 그게 전부예요, 우주인. 비행 중 몇 가지 간단한 작업 - 제 생각엔 당신에게 필요한 것 같아요. 왜 이 모든 일을 하는지 잊지 마세요 - 시스템에서 나가기 위해서요. 그러니 구름에서 분리하세요, 친구야!",
    finish3:
      "> 이 퀘스트는 Robonomics 팀에서 준비했습니다. 저희를 지원하거나 더 자세히 알아보고 싶으시다면 이 채팅에 메시지를 쓰세요. 그러면 개발자에게 전달됩니다. 행운을 빕니다!",
    reset:
      "거기서 뭘 하고 있는지 모르겠지만, 잘 들어봐—이번이 마지막 기회야, 친구. 이걸 놓치면 디지털 문이 닫힐 거야.",
    button_reset: "Try again",
    gameover:
      "음, 실수했군요, 우주 비행사, 정말 아쉽네요. 만약 언젠가 진짜로 블랙 미러에서 벗어나고 싶다면, 다시 찾아오세요. 하지만 지금은 — 작별입니다.",
  },
};
