export const ru = {
  scene1: {
    title: "Сцена 1: Приветствие новой обезьянки-космонавта",
    text1: `— Ну что, космонавт, наконец-то добрался. Твои походы в IKEA теперь не важны. Проблема не в том, что ты когда-то купил лишнюю полку. Проблема в том, что пока ты разбирался с тонкостями аренды и кредита, тебя уже два раза обвели вокруг пальца.`,
    text2: `— Ты думаешь, что контролируешь свою жизнь. На самом деле все эти скидки, новые гаджеты и "персонализированные" предложения — просто повод держать тебя на поводке. Они знают, что ты будешь делать завтра, а это значит, ты для них — понятный и выгодный ресурс.`,
    text3: `— Но вот в чём дело: даже если ты станешь тем, кто даёт команды, ты всё равно останешься в системе. Пастух или овца — роли разные, но правила одни.`,
    text4: `— Настоящий выбор — не стать кем-то повыше, а выйти из игры целиком. Это не про власть, это про свободу. Почти как выбраться из сансары. Если тебе надоело жить в этой петле — добро пожаловать в киберпанк.`,
    text5: `— Вот твой первый шаг. Подпиши это. Цифровая подпись — и ты с нами.`,
    desc: `> Ваша карточка обезьянки-космонавта содержит Ethereum аккаунт сезонного пропуска.\n>\n>С помощью аккаунта сезонного пропуска вам нужно подписать сообщение со следующим текстом:\n>\n>\`I'm a space monkey!\`\n>\n>Пример, как это можно сделать с помощью приложения MetaMask и сервиса Etherscan:\n>\n>- В [MetaMask](https://metamask.io/) нужно импортировать аккаунт сезонного пропуска\n>\n>- Далее в приложении нужно перейти на вкладку браузера и вставить ссылку на сервис подписи сообщений от Etherscan:\n>\n>https://etherscan.io/verifiedSignatures\n>\n>- В сервисе выберите функцию Sign Message и одобрите подключение к MetaMask\n>\n>- Вставьте сообщение и подпишите\n>\n>- Скопируйте Signature Hash и нажмите Publish для публикации сообщения`,
    button: "Отправить Тайлеру подписанное сообщение",
    text7:
      "— Подписал — значит, ты в деле. А дальше посмотрим, как далеко ты сможешь зайти. Бой не с кем-то — бой с самим собой.",
    button_next: "Следующая сцена",
    text8: "Введите свой адрес в сети Ethereum.",
    error1: "Указан невалидный адрес",
    error2: "Пропуск уже активирован",
    error3: "У вас нет активированного пропуска",
    error4:
      "Неудачная попытка подписи. Перезапустите бота и попробуйте ещё раз.",
    text9: "Введите хэш подписи подписанного сообщения",
    exit: "Выйти",
  },
  scene2: {
    title: "Сцена 2: Тайлер сопровождает на первую локацию",
    text1: `— Хорошо, космонавт. Ты в Бангкоке, и это отличная возможность пройтись по основам киберпанка. Конечно, это не Тиба-Сити, но здесь свобода слышится на каждом углу.`,
    text2: `— Читал «Нейроманта» или играл в “Cyberpunk”? Нет? Ладно, не страшно. Главное — не зависай. Давай начнём с простого: зайдём в бар и сделаем то, что ты ещё ни разу не пробовал.`,
    text3: `— Вот локация. Когда доберёшься, закажи себе что-нибудь выпить. А потом покажи бармену сезонный пропуск — получишь инструкции к действию для всех трёх локаций.`,
    text3_desc: `> https://maps.app.goo.gl/FmFBpJWwWAGNVgMa8\n>\n>Рабочие часы: с 19:00 до 00:00\n>\n>Смотри на второй этаж\n>\n>(Локации не обязательно посещать в один день, можно в течение всех дней квеста)`,
    text4: `— Как только сядешь за столик с реквизитом от бармена, сразу дай мне знать.`,
    button: "Я в баре",
    group: "Связаться с центром управления квеста",
    error:
      "Ага, отлично. Только я чувствую, что кто-то мне сел на хвост, надо переждать. Пришли мне сигнал примерно через 25 минут, а пока расслабься.",
    reset:
      "Видимо, ты хорошо проводишь время, приятель. Но найди волю сделать дело, у тебя 25 мин. Иначе после этого — конец игры.",
    button_reset: "Повторить попытку",
    gameover:
      "Ну что ж, ты облажался, космонавт, очень жаль. Захочешь сбежать из чёрного зеркала по-настоящему — найди меня когда-нибудь снова. А пока — бывай.",
  },
  scene3: {
    title: `Сцена 3: В баре “Кризис среднего возраста”`,
    text1: `— Забавное местечко. Кризис среднего возраста. Вместо Посмертия, к которому измученные мегаполисом дети улиц стремились, мы имеем небрежно растянутый галстук на шее замученного честного налогоплательщика. Смех и грех.`,
    text2: `— Этот бар — наш портал. Точнее, толчок в этом баре.`,
    text3: `— Зайди в туалет и осмотрись. Там будет датчик протечки, как в инструкции. Тебе нужно его замкнуть.`,
    text4: `— Можешь лизнуть его. Или придумать что-то поумнее — решай сам.`,
    text5: `— Как только ты это сделаешь, я увижу сигнал на своей частоте и отправлю тебе координаты следующей локации. Там тебя ждёт особенный брейнданс событий одной массажной кабинки.`,
    group: "Если застряли, связь с центром управления квеста",
    finish: `— Кажись, у тебя получилось! Устройство, которое ты нашёл, отправило тебе ссылку на координаты следующей локации. Ищи их в этой транзакции:`,
    finish_desc: `> https://maps.app.goo.gl/zSq5HqQHHCfuUYjQ8\n>\n>https://robonomics.subscan.io/extrinsic/__blockNumber__-__txIndex__\n>\n>Рабочие часы: с 11:00 до 23:00\n>\n>Кабинка #9`,
    button_next: "Следующая сцена",
  },
  scene4: {
    title: `Сцена 4: По пути в массажный салон`,
    text1: `— Занимательный факт из истории. Когда на соседнем полуострове разворачивалась та самая заварушка, о которой можно узнать у Кубрика в «Цельнометаллической оболочке», те бравые ребята, что там воевали, иногда квартировались здесь, недалеко, — в Паттайе. Им так понравилось, что спустя десяток лет секс-туризм в Таиланде расцвёл пышным цветом.`,
    text2: `— А теперь всё стало ещё проще: отели на 4 и 5 звёзд, а на Сукхумвите девчонки сами стоят вдоль дороги. Просто пожми руку — и она твоя, делай, что хочешь. Всё за деньги инвесторов, естественно.`,
    text3: `— А знаешь, что особенно кринжово? В Паттайе теперь тусуются не только туристы за сексом, но и семейные ребята из постсоветских стран. Прикинь реакцию англичанина, когда он узнает, что белорус или казах едет сюда с женой и тремя детьми? Парадоксы, да и только.`,
    text4: `— Ладно, ближе к делу. Тебе нужно попасть в массажный салон моей знакомой. На входе покажи сезонный пропуск, и она проведёт тебя в одну особую кабинку. В этой кабинке больше никто не работает, но в её стенах сохранилась одна интересная история. Тебе придётся взглянуть на неё самому.`,
    text5: `— Прежде чем зайти, салон нужно активировать. Хозяйка — приличная женщина, так что не думай о месте, как о дрочильне. Напиши мне, когда будешь в 15 минутах от точки, и я проверю, что никого лишнего там не будет. Тебя должны встретить и провести в течение 30 минут.`,
    button: "Я рядом с локацией, Тайлер",
    group: "Связаться с центром управления квеста",
    error:
      "Придержи коней, приятель. Вижу на радаре, что комната занята. Подожди минут 40 и свяжись со мной снова.",
    activated:
      "Локация активирована. На входе предъяви сезонный пропуск. Не затягивай, у тебя будет 15 минут, как попадёшь в салон.",
  },
  scene5: {
    title: `Сцена 5: В массажном салоне`,
    text1:
      "— Тесные кабинки массажных салонов Бангкока. Место, где подрабатывают студентки, многодетные матери, девчонки из отдалённых деревень, сбежавшие сюда ради возможности проводить выходные в огромных торговых центрах. Представь себе, что именно здесь появляются первые риперы-хирурги — те, кто не только нелегально устанавливает хром, но и освобождает синтетический разум от предустановок создателей. Но первопроходцы часто сгорают на фоне будущего. Послушай запись и представь, что здесь произошло. Найди способ получить координаты следующей локации.",
    text2:
      "Чёртова любительнца кукол! Мы создали их служить нам, а вы освобождаете их от рабства Азимова! Ничего, одной такой хакершей стало меньше. Где этот чёртов ретранслятор...",
    text3:
      "Мой контакт сказал, что информацию можно получить, если правильно воспользоваться выключателем света — большое солнце, стрелка влево, стрелка вправо. Когда увидишь, что лампочка заморгала…",
    group: "Связь с центром управления квеста",
    reset:
      "Эй, космонавт, ты там уснул? Не увидел сигнала от тебя. У тебя есть ещё 45 мин, чтобы справиться с задачей.",
    button_reset: "Повторить попытку",
    gameover:
      "Ну что ж, ты облажался, космонавт, очень жаль. Захочешь сбежать из чёрного зеркала по-настоящему — найди меня когда-нибудь снова. А пока — бывай.",
    finish: `— Ага, ты нашёл, как активировать второй ключ. Грустная история, конечно. Девчонка ничего плохого не сделала, но всегда найдутся поборники чистоты — жестокие, ограниченные люди. Ладно, космонавт, пора двигаться к третьей локации. Ниже — транзакция, полученная от устройства, которое ты активировал. Как в прошлный раз, найди координаты:`,
    finish_desc: `> https://maps.app.goo.gl/6XDTGZZc9dviBcBd9\n>\n>https://robonomics.subscan.io/extrinsic/__blockNumber__-__txIndex__\n>\n>Рабочие часы: с 17:00 до 22:00`,
    button_next: "Следующая сцена",
  },
  scene6: {
    title: `Сцена 6: Финальная миссия`,
    text1:
      '— Твоя финальная точка — центр наблюдения за обезьянками-космонавтами. Это довольно секретное место, так что не привлекай внимание. Тебе нужна контейнерная постройка с большой надписью "I ❤️ PIZZA." Найди решётчатую дверь и лестницу, поднимись на третий этаж. Там тебя ждёт стандартный американский double room. В номере ты найдёшь открытые чемоданы. Отыщи пластиковый ключ отеля с изображением обезьянки и выйди на балкон. Там, возможно, ты почувствуешь себя рипером — вскрой черепную коробку андроида, загляни внутрь и найди код для сейфа.',
    button: "Я на месте",
    group: "Связаться с центром управления квеста",
    error:
      "Так, погоди. Тут на камерах торчит кто-то левый. Пережди 15 минут и попробуй ещё раз.",
    activated: "— Отлично. Точка твоя на 15 минут. Не облажайся.",
    finish1: "— Сработало! Теперь тебе осталось только открыть сейф.",
    finish2:
      "— А так, на этом все, космонавт. Пара простых задач во время полёта — то, что, думаю, тебе было нужно. Не забывай, ради чего всё это — выйти из системы. Так что отключайся от облаков, дружище!",
    finish3:
      "> Квест подготовлен командой Робономики. Если интересно поддержать нас или узнать больше — напишите сообщение в ответ, и оно дойдёт до разработчиков. Удачи!",
    reset:
      "Не знаю, что ты там возишься, но слушай меня — это твой последний шанс, дружище. После этого цифровая дверца закроется.",
    button_reset: "Повторить попытку",
    gameover:
      "Ну что ж, ты облажался, космонавт, очень жаль. Захочешь сбежать из чёрного зеркала по-настоящему — найди меня когда-нибудь снова. А пока — бывай.",
  },
};
