export const ru = {
  scene1: {
    title: "### Сцена 1: Приветствие новой обезьянки-космонавта",
    text1: `— Ну что, космонавт, наконец-то добрался. Твои походы в IKEA теперь не важны. Проблема не в том, что ты когда-то купил лишнюю полку. Проблема в том, что пока ты разбирался с тонкостями аренды и кредита, тебя уже два раза обвели вокруг пальца.`,
    text2: `— Ты думаешь, что контролируешь свою жизнь. На самом деле, все эти скидки, новые гаджеты и "персонализированные" предложения — просто повод держать тебя на поводке. Они знают, что ты будешь делать завтра, а это значит, ты для них — понятный и выгодный ресурс.`,
    text3: `— Но вот в чём дело: даже если ты станешь тем, кто даёт команды, ты всё равно останешься в системе. Пастух или овца`,
    text4: `— роли разные, но правила одни.`,
    text5: `— Настоящий выбор — не стать кем-то повыше, а выйти из игры целиком. Это не про власть, это про свободу. Почти как выбраться из сансары. Если тебе надоело жить в этой петле — добро пожаловать в киберпанк.`,
    text6: `— Вот твой первый шаг. Подпиши это. Цифровая подпись — и ты с нами.`,
    desc: `Используйте свой аккаунт с активированным сезонным пропуском, чтобы подписать сообщение с текстом "Я обезьянка-космонавт!". Использутей для этого например приложение metamask и сервис подписи сообщение от etherscan.`,
    button: "Отправить Тайлеру подписанное сообщение",
    text7:
      "— Подписал — значит, ты в деле. А дальше посмотрим, как далеко ты сможешь зайти. Бой не с кем-то, бой с самим собой.",
    button_next: "Следующая сцена",
  },
  scene2: {
    title: "### Сцена 2: Тайлер сопровождает на первую локацию",
    text1: `— Хорошо, космонавт. Ты в Бангкоке, и это отличная возможность пройтись по основам киберпанка. Конечно, это не Тиба-Сити, но здесь свобода слышится на каждом углу.`,
    text2: `— Читал «Нейроманта» или играл в Cyberpunk? Нет? Ладно, не страшно. Главное, не зависай. Давай начнём с простого: зайдём в бар и сделаем то, чего ты ещё ни разу не пробовал.`,
    text3: `— Вот локация. Когда доберёшься, закажи себе что-нибудь выпить. А потом покажи бармену сезонный пропуск — он даст тебе инструкции к действию для всех 3 локаций.`,
    text4: `— Как только сядешь за столик с реквизитом от бармена, сразу дай мне знать.`,
    button: "Я в баре",
  },

  //   ### Сцена 3: В баре — кризис среднего возраста
  // Тайлер голосовым сообщением:
  // — Забавное местечко. Кризис среднего возраста. Вместо посметрия, к которому измученные мегаполисом дети улиц стремились мы имеем небрежно растянутый галстук на шее замученного честного налогоплательщика. Смех и грех. Этот бар наш портал.  Точнее толчок в этом баре.
  // — Этот бар — не просто бар. Это наш портал. Или, если точнее, толчок.
  // — Зайди в туалет и осмотрись. Там будет датчик протечки, как в инструкции. Тебе нужно его замкнуть.
  // — Можешь лизнуть его. Или придумать что-то поумнее — решай сам.
  // — Как только ты это сделаешь, я увижу сигнал на своей частоте. И отправлю тебе координаты следующей локации. Там тебя ждёт особенный брейнденс событий одной массажной кабинки.
  // Сработал датчик в туалете бара
  // Тайлер: кажись у тебя получилось! Вот координаты следующей локации:
  // Запись в Робономике: <ссылка на subscan>

  // >> Следующая сцена

  // ===================

  //   ### Сцена 4: По пути в массажный салон
  // Тайлер голосовым сообщением:
  // — Занимательный факт из истории. Когда на соседнем полуострове разворачивалась та самая заварушка, о которой можно узнать у Кубрика в «Цельнометаллической оболочке», те бравые ребята, что там воевали, иногда квартировались здесь, недалеко — в Паттайе. Им так понравилось, что спустя десяток лет секс-туризм в Таиланде расцвёл пышным цветом.
  // — А теперь всё стало ещё проще: отели на 4 и 5 звёзд, а на Сукхумвите девчонки сами стоят вдоль дороги. Просто пожми руку, и она твоя — делай, что хочешь. Всё за деньги инвесторов, естественно.
  // — А знаешь, что особенно кринжово? В Паттайе теперь тусуются не только туристы за сексом, но и семейные ребята из постсоветских стран. Прикинь реакцию англичанина, когда он узнаёт, что белорус или казах едет сюда с женой и тремя детьми? Парадоксы, да и только.
  // — Ладно, ближе к делу. Тебе нужно попасть в массажный салон моей знакомой. На входе покажи сезонный пропуск, и она проведёт тебя в одну особую кабинку. В этой кабинке больше никто не работает, но в её стенах сохранилась одна интересная история. Тебе придётся взглянуть на неё самому.
  // — Прежде чем зайти, салон нужно активировать. Хозяйка — приличная женщина, так что не думай о месте, как о дрочильне. Напиши мне, когда будешь в 15 минутах от точки, и я проверю, что никого лишнего там не будет. Тебя должны встретить и провести в течение 30 минут.

  // >> Активировать локацию на 45 мин
  // >> Связаться с центром управления квеста

  // — Локация активирована. Координаты у тебя. На входе предъяви сезонный пропуск. Не затягивай.

  // >> Следующая сцена
};
